{
  "id": "as92006-usability-pairmatch-set-expanded",
  "type": "pair-match-set",
  "title": "Usability Principles and Concepts",
  "description": "Match each usability term to its correct description.",
  "questions": [
    {
      "id": "as92006-match-principles-001",
      "type": "pair-match",
      "title": "Core Usability Heuristics",
      "pairs": [
        {
          "left": "Visibility of system status",
          "right": "Keeping the user informed about what is happening (e.g., a progress bar)."
        },
        {
          "left": "Match with the real world",
          "right": "Using familiar language and concepts, like a 'shopping cart' icon on an e-commerce site."
        },
        {
          "left": "User control and freedom",
          "right": "Providing an 'undo' button or a clear 'exit' to let users easily fix mistakes."
        },
        {
          "left": "External consistency",
          "right": "An interface works in a way that feels familiar based on how other common apps work."
        }
      ],
      "distractorsRight": [
        "Making the interface pretty with lots of colours and fonts.",
        "Using technical jargon to sound more professional.",
        "Adding extra menu options to show more features.",
        "Providing keyboard shortcuts for advanced users only."
      ],
      "omiMapping": ["identify_usability_principles"]
    },
    {
      "id": "as92006-match-principles-002",
      "type": "pair-match",
      "title": "Design Quality and Support",
      "pairs": [
        {
          "left": "Error prevention",
          "right": "Designing to make mistakes less likely, like disabling a button until a form is complete."
        },
        {
          "left": "Aesthetic and minimalist design",
          "right": "Avoiding clutter by only showing relevant information needed for the current task."
        },
        {
          "left": "Help users recover from errors",
          "right": "Providing clear, plain-language messages that explain what went wrong and how to fix it."
        },
        {
          "left": "Accessibility",
          "right": "Designing an interface so it can be used by people with disabilities, such as screen-reader users."
        }
      ],
      "distractorsRight": [
        "Ensuring the app is available in many different countries.",
        "Using bright colours to attract attention to every element.",
        "Adding hidden Easter eggs for experienced users.",
        "Requiring memorisation of keyboard sequences for critical tasks."
      ],
      "omiMapping": ["identify_usability_principles"]
    }
  ]
}
